nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/EVSE_Shell.c
/*
 * Copyright 2024-2026 NXP
 * NXP Proprietary. This software is owned or controlled by NXP and may only be used strictly in
 * accordance with the applicable license terms. By expressly accepting such terms or by downloading, installing,
 * activating and/or otherwise using the software, you are agreeing that you have read, and that you agree to comply
 * with and are bound by, such license terms. If you do not agree to be bound by the applicable license terms, then you
 * may not retain, install, activate or otherwise use the software.
 */

#if (ENABLE_SHELL == 1)

#include "FreeRTOS.h"
#include "task.h"
#include "event_groups.h"

#include "fsl_component_serial_manager.h"
#include "fsl_component_serial_port_usb.h"
#include "virtual_com.h"
#include "fsl_shell.h"
#if EASYEVSE_EV
#include "board.h"
#include "EVSE_Utils.h"
#endif /* EASYEVSE_EV */

#include "EVSE_Shell.h"
#include "EVSE_ConnectivityConfig.h"

#if ENABLE_WIFI
#include "EVSE_Connectivity.h" //for wifi credentials
#endif                         /* ENABLE_WIFI */

#if ENABLE_SE
#include "se05x_BinaryFile.h"
#include "EVSE_Secure_Element.h"
#endif /* ENABLE_SE */

#if ENABLE_SIGBOARD
#include "EVSE_Metering.h"
#if (SIGBRD == EM_HPGP)
#include "comm_command_proc_host.h"
#elif ((SIGBRD == HPGP) || (SIGBRD == SIGBRD2X))
#include "hal_uart_bridge.h"
#endif
#endif /* ENABLE_SIGBOARD */

#if ENABLE_ISO15118
#include <ISO15118.h>
#endif /* ENABLE_ISO15118 */

#include "EVSE_ChargingProtocol.h"

#define EVSE_SERIAL_MANAGER_RECEIVE_BUFFER_LEN 2048U

/* Maximum number of arguments for a command */
#define EVSE_ARGC_MAX 5
/* Maximum argv string size */
#define EVSE_ARGV_STR_MAX 64

#if ENABLE_CHARGING_PROTOCOL
#define AUTH_CARD_UID "AUTH_FROM_CLI"
#endif /* ENABLE_CHARGING_PROTOCOL */

#define CONTROLLER_ID kSerialManager_UsbControllerEhci0

extern void USB_DeviceClockInit(void);

extern bool deviceIDReady;

static shell_status_t EV_cp_state_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EV_charging_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EV_auth_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EV_protocol_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EV_battery_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EV_direction_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EV_version_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EV_datetime_handler(shell_handle_t shellHandle, int32_t argc, char **argv);

static shell_status_t EVSE_version_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EVSE_wifi_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EVSE_se05x_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EVSE_auth_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EVSE_payment_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EVSE_ocpp_info_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EVSE_charging_handler(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t EVSE_meter_info_handler(shell_handle_t shellHandle, int32_t argc, char **argv);

/*******************************************************************************
 * Variables
 ******************************************************************************/

#if (EASYEVSE_EV == 1)
SHELL_COMMAND_DEFINE(version,
                     "\r\n\"version\": Print SW/HW version of the SIGBOARD\r\n",
                     EV_version_handler,
                     0);

SHELL_COMMAND_DEFINE(cp,
                    "\r\n\"cp\": Connect or disconnect CP line:\r\n"
                    "                 Usage:\r\n"
                    "                     cp connect \r\n"
                    "                     cp disconnect \r\n",
                    /* if more than the specified number of parameters, the rest of the parameters will be ignored */
                    EV_cp_state_handler,
                    SHELL_IGNORE_PARAMETER_COUNT);

SHELL_COMMAND_DEFINE(charge,
                    "\r\n\"charge\": Start or stop charging session:\r\n"
                    "                 Usage:\r\n"
                    "                     charge start \r\n"
                    "                     charge stop \r\n",
                    EV_charging_handler,
                    SHELL_IGNORE_PARAMETER_COUNT);

SHELL_COMMAND_DEFINE(protocol,
                    "\r\n\"protocol\": Select charging protocol:\r\n"
                    "                 Usage:\r\n"
                    "                     protocol J1772 \r\n"
                    "                     protocol ISO15118-2 \r\n"
                    "                     protocol ISO15118-20 \r\n",
                    EV_protocol_handler,
                    SHELL_IGNORE_PARAMETER_COUNT);

SHELL_COMMAND_DEFINE(battery,
                    "\r\n\"battery\": Reset battery level:\r\n"
                    "                 Usage:\r\n"
                    "                     battery full \r\n"
                    "                     battery empty \r\n",
                    /* if more than the specified number of parameters, the rest of the parameters will be ignored */
                    EV_battery_handler,
                    SHELL_IGNORE_PARAMETER_COUNT);

#if ENABLE_ISO15118
SHELL_COMMAND_DEFINE(auth,
                    "\r\n\"auth\": Select authentication method:\r\n"
                    "                 Usage:\r\n"
                    "                     auth EIM \r\n"
                    "                     auth PnC \r\n",
                    EV_auth_handler,
                    SHELL_IGNORE_PARAMETER_COUNT);

SHELL_COMMAND_DEFINE(direction,
                    "\r\n\"direction\": Change charging direction:\r\n"
                    "                 Usage:\r\n"
                    "                     direction change\r\n",
                    /* if more than the specified number of parameters, the rest of the parameters will be ignored */
                    EV_direction_handler,
                    SHELL_IGNORE_PARAMETER_COUNT);

