nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/EVSE_Shell.c
SHELL_COMMAND_DEFINE(date,
                    "\r\n\"date\": Set/get the date and time (UTC format):\r\n"
                    "                 Usage:\r\n"
                    "                     date set YYYY-MM-DDTHH:MM:SSZ\r\n"
                    "                     (e.g. date set 2026-01-15T14:30:00Z)\r\n"
                    "                     date get\r\n",
                    /* if more than the specified number of parameters, the rest of the parameters will be ignored */
                    EV_datetime_handler,
                    SHELL_IGNORE_PARAMETER_COUNT);
#endif /* ENABLE_ISO15118 */
shell_command_t* shell_commands_list[] = {SHELL_COMMAND(version),
                                         SHELL_COMMAND(cp),
                                         SHELL_COMMAND(charge),
#if ENABLE_ISO15118
                                         SHELL_COMMAND(auth),
                                         SHELL_COMMAND(direction),
										 SHELL_COMMAND(date),
#endif
                                         SHELL_COMMAND(protocol),
                                         SHELL_COMMAND(battery)
                                        }; // list of shell commands that will be registered
#else
SHELL_COMMAND_DEFINE(version,
                     "\r\n\"version\": Print SW version of the EVSE and SW/HW version of the SIGBOARD\r\n",
                     EVSE_version_handler,
                     0);

#if ENABLE_WIFI
SHELL_COMMAND_DEFINE(wifi,
                     "\r\n\"wifi\": Setup WiFi Network Credentials:\r\n"
                     "                 Usage:\r\n"
                     "                     wifi set SSID PASSWORD\r\n"
                     "                 Parameters:\r\n"
                     "                 SSID:       The name of the WiFi network [max 32 characters]\r\n"
                     "                 PASSWORD:   The password for the WiFi network [max 64 characters]\r\n"
                     "                 ssid and password should not contain double quotes\r\n"
                     "                 ssid and password must be placed between double quotes if they contain spaces "
                     "(e.g \"password 123\")\r\n"
                     "              Erase WiFi Network Credentials from flash:\r\n"
                     "                 Usage:\r\n"
                     "                     wifi erase\r\n"
                     "              Print WiFi Network Credentials from flash:\r\n"
                     "                 Usage:\r\n"
                     "                     wifi print\r\n",
                     EVSE_wifi_handler,
                     SHELL_IGNORE_PARAMETER_COUNT);
#endif /* ENABLE_WIFI */

#if ENABLE_SE
SHELL_COMMAND_DEFINE(se05x,
                     "\r\n\"se05x\": Erase content of Secure Element:\r\n"
                     "                 Usage:\r\n"
                     "                     se05x erase cpokey - erase the ISO15118-2/20 CPO key\r\n"
					 "                     se05x erase ocppkey - erase the OCPP client key\r\n",
                     EVSE_se05x_handler,
                     SHELL_IGNORE_PARAMETER_COUNT);
#endif /* ENABLE_SE */

#if ENABLE_ISO15118
SHELL_COMMAND_DEFINE(auth,
                     "\r\n\"auth\": Authenticate the EV without tapping the NFC card:\r\n"
                     "                 Usage:\r\n"
                     "                     auth true\r\n",
                     EVSE_auth_handler,
                     SHELL_IGNORE_PARAMETER_COUNT);

SHELL_COMMAND_DEFINE(iso_payment,
                     "\r\n\"iso_payment\": Set iso15118 payment method:\r\n"
                     "                 Usage:\r\n"
                     "                     iso_payment eim - for EIM \r\n"
                     "                     iso_payment pnc - for PNC \r\n",
                     EVSE_payment_handler,
                     SHELL_IGNORE_PARAMETER_COUNT);

#endif /* ENABLE_ISO15118 */

SHELL_COMMAND_DEFINE(ocpp_info,
                     "\r\n\"ocpp_info\": Print OCPP server connection info\r\n"
                     "                 Usage:\r\n"
                     "                     ocpp_info\r\n",
                     EVSE_ocpp_info_handler,
                     0);

SHELL_COMMAND_DEFINE(charging,
                     "\r\n\"charging\": Starts or stops the charging session\r\n"
                     "                 Usage:\r\n"
                     "                     charging start\r\n"
                     "                     charging stop\r\n",
                     EVSE_charging_handler,
                     SHELL_IGNORE_PARAMETER_COUNT);

SHELL_COMMAND_DEFINE(meter_info,
                     "\r\n\"meter_info\": Print data retrieved from EMETER\r\n"
                     "                 Usage:\r\n"
                     "                     meter_info\r\n",
                     EVSE_meter_info_handler,
                     0);

shell_command_t* shell_commands_list[] = {SHELL_COMMAND(version),
#if ENABLE_WIFI
                                         SHELL_COMMAND(wifi),
#endif /* ENABLE_WIFI */
#if ENABLE_SE
                                         SHELL_COMMAND(se05x),
#endif /* ENABLE_SE */
#if ENABLE_ISO15118
                                         SHELL_COMMAND(auth),
                                         SHELL_COMMAND(iso_payment),
#endif /* ENABLE_ISO15118 */
                                         SHELL_COMMAND(ocpp_info),
                                         SHELL_COMMAND(charging),
                                         SHELL_COMMAND(meter_info)
                                        };
#endif /* EASYEVSE_EV */

static uint8_t s_shellHandleBuffer[SHELL_HANDLE_SIZE] __attribute__((aligned(4)));
static shell_handle_t s_shellHandle = NULL;

static uint8_t s_serialHandleBuffer[SERIAL_MANAGER_HANDLE_SIZE] __attribute__((aligned(4)));
static serial_handle_t s_serialHandle = &s_serialHandleBuffer[0];

static uint8_t ucSampleIotHubDeviceId[EVSE_DEVICEID_MAX_BUFFER];

