nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/EVSE_Shell.c
#if (defined(SERIAL_MANAGER_NON_BLOCKING_MODE) && (SERIAL_MANAGER_NON_BLOCKING_MODE > 0U))
AT_NONCACHEABLE_SECTION_ALIGN(uint8_t s_readRingBuffer[EVSE_SERIAL_MANAGER_RECEIVE_BUFFER_LEN], 32);
#endif

extern serial_handle_t g_serialHandle;

static EventGroupHandle_t s_shell_event;

static uint8_t evse_argc                                    = 0;
static char evse_argv[EVSE_ARGC_MAX + 1][EVSE_ARGV_STR_MAX] = {0};

static bool s_authorizedFromCLI = false;

/*******************************************************************************
 * Code
 ******************************************************************************/

int EVSE_Shell_Printf(const char *formatString, ...)
{
    /* Check format string */

    va_list args;
    int status;

    va_start(args, formatString);

    /* Check if shell initialized */
    if (s_shellHandle != NULL)
    {
        status = SHELL_PrintfVaList(s_shellHandle, formatString, args);
        va_end(args);
        return status;
    }

    va_end(args);
    return -1;
}

#if (EASYEVSE_EV == 1)
static shell_status_t EV_cp_state_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    shell_status_t status = kStatus_SHELL_Success;

    if (argc != 2)
    {
        SHELL_Printf(s_shellHandle, COMMAND_ERROR);
        status = kStatus_SHELL_Error;
    }

    if (status == kStatus_SHELL_Success)
    {
        if ((strcmp(argv[1], "connect") != 0) && (strcmp(argv[1], "disconnect") != 0))
        {
            SHELL_Printf(s_shellHandle, COMMAND_ERROR);
            return kStatus_SHELL_Error;
        }

        evse_argc = argc;
        for (uint8_t i = 0; i < argc; i++)
        {
            strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
            evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
        }
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EV_SHELL_CONNECT_DISCONNECT_CP_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static shell_status_t EV_cp_cmd_do(void)
{
    if (strcmp(evse_argv[1], "connect") == 0)
    {
        /* Connect CP lines */
        configPRINTF(("Connected CP"));
        GPIO_PinWrite(BOARD_CP_TOGGLE_PORT, BOARD_CP_TOGGLE_PIN, 1U);
    }
    else if (strcmp(evse_argv[1], "disconnect") == 0)
    {
        /* Disconnect CP lines */
        configPRINTF(("Disconnected CP"));
        GPIO_PinWrite(BOARD_CP_TOGGLE_PORT, BOARD_CP_TOGGLE_PIN, 0U);
    }
}

static shell_status_t EV_charging_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    shell_status_t status = kStatus_SHELL_Success;

    if (argc != 2)
    {
        SHELL_Printf(s_shellHandle, COMMAND_ERROR);
        status = kStatus_SHELL_Error;
    }

    if (status == kStatus_SHELL_Success)
    {
        if ((strcmp(argv[1], "start") != 0) && (strcmp(argv[1], "stop") != 0))
        {
            SHELL_Printf(s_shellHandle, COMMAND_ERROR);
            return kStatus_SHELL_Error;
        }

        evse_argc = argc;
        for (uint8_t i = 0; i < argc; i++)
        {
            strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
            evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
        }
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EV_SHELL_START_STOP_CHARGING_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static shell_status_t EV_charge_cmd_do(void)
{
    evse_return_status_t status = FAIL;

    if (strcmp(evse_argv[1], "start") == 0)
    {
        /* Start charging */
        status = EV_ChargingProtocol_StartCharging();
    }
    else if (strcmp(evse_argv[1], "stop") == 0)
    {
        /* Stop charging */
        status = EV_ChargingProtocol_StopCharging();
    }

    if(status == SUCCESS)
    {
//            SHELL_Printf(s_shellHandle, "charge command sent successfully \r\n");
    }
    else if (status == FAIL)
    {
        SHELL_Printf(s_shellHandle, "charge command NOT sent \r\n");
    }
    else if (status == NOT_IMPLEMENTED)
    {
        SHELL_Printf(s_shellHandle, "charge command NOT implemented \r\n");
    }
}

#if ENABLE_ISO15118
static shell_status_t EV_auth_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    shell_status_t status = kStatus_SHELL_Success;

    if (argc != 2)
    {
        SHELL_Printf(s_shellHandle, COMMAND_ERROR);
        status = kStatus_SHELL_Error;
    }

    if (status == kStatus_SHELL_Success)
    {
        if ((strcmp(argv[1], "EIM") != 0) && (strcmp(argv[1], "PnC") != 0))
        {
            SHELL_Printf(s_shellHandle, COMMAND_ERROR);
            return kStatus_SHELL_Error;
        }

        evse_argc = argc;
        for (uint8_t i = 0; i < argc; i++)
        {
            strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
            evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
        }
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EV_SHELL_CHANGE_AUTH_METHOD_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static shell_status_t EV_auth_cmd_do(void)
{
    if (strcmp(evse_argv[1], "EIM") == 0)
    {
        /* Select EIM auth method at runtime */
        EV_ChargingProtocol_SetAuthMethod(VehicleAuth_EIM);
        configPRINTF(("Set auth method to EIM"));

    }
    else if (strcmp(evse_argv[1], "PnC") == 0)
    {
        /* Select PnC auth method at runtime */
        EV_ChargingProtocol_SetAuthMethod(VehicleAuth_PnC);
        configPRINTF(("Set auth method to PnC"));
    }
}

static shell_status_t EV_direction_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    shell_status_t status = kStatus_SHELL_Success;

    if (argc != 2)
    {
        SHELL_Printf(s_shellHandle, COMMAND_ERROR);
        status = kStatus_SHELL_Error;
    }

    if (status == kStatus_SHELL_Success)
    {
        if (strcmp(argv[1], "change") != 0)
        {
            SHELL_Printf(s_shellHandle, COMMAND_ERROR);
            return kStatus_SHELL_Error;
        }

        evse_argc = argc;
        for (uint8_t i = 0; i < argc; i++)
        {
            strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
            evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
        }
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EV_SHELL_CHANGE_CHARGING_DIRECTION_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static shell_status_t EV_direction_cmd_do(void)
{
    if (strcmp(evse_argv[1], "change") == 0)
    {
        evse_charging_protocol_t current_charging_protocol = EV_ChargingProtocol_GetProtocol();
        if (current_charging_protocol == EVSE_HighLevelCharging_ISO15118_20)
        {
            EV_ChargingProtocol_ChangeChargingDirection();
            configPRINTF(("Charging direction changed"));
        }
        else
        {
            configPRINTF((warning("Charging direction cannot be changed because ISO15118-20 is not enabled. Charging will be stopped")));
            EV_ChargingProtocol_StopCharging();
        }
    }
}
static shell_status_t EV_datetime_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    shell_status_t status = kStatus_SHELL_Success;

