nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/EVSE_Shell.c
    if (argc > 3)
    {
    	SHELL_Printf(s_shellHandle, COMMAND_ERROR);
    	return kStatus_SHELL_Error;
    }

    if (strcmp(evse_argv[1], "set") == 0)
    {
    	if (strlen(argv[2]) < 10
    			|| strlen(argv[2]) > 20)
    	{
    		SHELL_Printf(s_shellHandle, COMMAND_ERROR);
    		return kStatus_SHELL_Error;
    	}
    }

    evse_argc = argc;
    for (uint8_t i = 0; i < argc; i++)
    {
    	strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
    	evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
    }


    xResult = xEventGroupSetBitsFromISR(s_shell_event, EV_SHELL_DATETIME_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
    	portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static shell_status_t EV_datetime_cmd_do(void)
{
	time_t timestamp = 0;

	if (strcmp(evse_argv[1], "set") == 0)
	{
		if (rfc3339_to_utc_timestamp(evse_argv[2], &timestamp) == 0)
		{
			EV_SetTimestamp(timestamp);
		}
		else
		{
			SHELL_Printf(s_shellHandle, "Unable to convert date to timestamp.");
		}
	}
	else if (strcmp(evse_argv[1], "get") == 0)
	{
		timestamp = EV_GetTimestamp();
		char date_buff[21] = {0};
		if (utc_timestamp_to_rfc3339(timestamp, date_buff, sizeof(date_buff)) == 0)
		{
			SHELL_Printf(s_shellHandle, "date: %s\r\n", date_buff);
		}
		else
		{
			SHELL_Printf(s_shellHandle, "Unable to convert timestamp to date.");
		}
		SHELL_Printf(s_shellHandle, "timestamp: %ld\r\n", timestamp);
	}
	else
	{
		SHELL_Printf(s_shellHandle, "Incorrect parameters \r\n");
	}


}
#endif /* ENABLE_ISO15118 */

static shell_status_t EV_protocol_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    shell_status_t status = kStatus_SHELL_Success;

    if (argc != 2)
    {
        SHELL_Printf(s_shellHandle, COMMAND_ERROR);
        status = kStatus_SHELL_Error;
    }

    if (status == kStatus_SHELL_Success)
    {
        if ((strcmp(argv[1], "J1772") != 0) && (strcmp(argv[1], "ISO15118-2") != 0) && (strcmp(argv[1], "ISO15118-20") != 0))
        {
            SHELL_Printf(s_shellHandle, COMMAND_ERROR);
            return kStatus_SHELL_Error;
        }

        evse_argc = argc;
        for (uint8_t i = 0; i < argc; i++)
        {
            strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
            evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
        }
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EV_SHELL_CHANGE_PROTOCOL_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static shell_status_t EV_protocol_cmd_do(void)
{
    evse_return_status_t status = FAIL;

    if (strcmp(evse_argv[1], "J1772") == 0)
    {
        status = EV_ChargingProtocol_SetProtocol(EVSE_BasicCharging_J1772);
    }
    else if (strcmp(evse_argv[1], "ISO15118-2") == 0)
    {
#if ENABLE_ISO15118
        status = EV_ChargingProtocol_SetProtocol(EVSE_HighLevelCharging_ISO15118);
#else
        SHELL_Printf(s_shellHandle,"ISO15118 not enabled");
#endif /* ENABLE_ISO15118 */
    }
    else
    {
#if ENABLE_ISO15118
        status = EV_ChargingProtocol_SetProtocol(EVSE_HighLevelCharging_ISO15118_20);
#else
        SHELL_Printf(s_shellHandle,"ISO15118 not enabled");
#endif /* ENABLE_ISO15118 */
    }

    if(status == SUCCESS)
    {
//            SHELL_Printf(s_shellHandle, "protocol command sent successfully \r\n");
    }
    else if (status == FAIL)
    {
        SHELL_Printf(s_shellHandle, "protocol command NOT sent \r\n");
    }
    else if (status == NOT_IMPLEMENTED)
    {
        SHELL_Printf(s_shellHandle, "protocol command NOT implemented \r\n");
    }
}

static shell_status_t EV_battery_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    shell_status_t status = kStatus_SHELL_Success;

    if (argc != 2)
    {
        SHELL_Printf(s_shellHandle, COMMAND_ERROR);
        status = kStatus_SHELL_Error;
    }

    if (status == kStatus_SHELL_Success)
    {
        if ((strcmp(argv[1], "full") != 0) && (strcmp(argv[1], "empty") != 0))
        {
            SHELL_Printf(s_shellHandle, COMMAND_ERROR);
            return kStatus_SHELL_Error;
        }

        evse_argc = argc;
        for (uint8_t i = 0; i < argc; i++)
        {
            strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
            evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
        }
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EV_SHELL_RESET_BATTERY_LEVEL_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static shell_status_t EV_battery_cmd_do(void)
{
    evse_return_status_t status = FAIL;
    if (strcmp(evse_argv[1], "full") == 0)
    {
        status = EV_ChargingProtocol_ResetBatteryLevel(FULL_BATTERY);
    }
    else if (strcmp(evse_argv[1], "empty") == 0)
    {
        status = EV_ChargingProtocol_ResetBatteryLevel(EMPTY_BATTERY);
    }

    if(status == SUCCESS)
    {
//            SHELL_Printf(s_shellHandle, "battery command sent successfully \r\n");
    }
    else if (status == FAIL)
    {
        SHELL_Printf(s_shellHandle, "battery command NOT sent \r\n");
    }
    else if (status == NOT_IMPLEMENTED)
    {
        SHELL_Printf(s_shellHandle, "battery command NOT implemented \r\n");
    }
}

static void EV_version_cmd_do(void)
{
#if ENABLE_SIGBOARD
    uint32_t SIGBRD_HW_version        = 0;
    uint32_t SIGBRD_SW_version_major  = 0;
    uint32_t SIGBRD_SW_version_minor  = 0;
    uint32_t SIGBRD_SW_version_bugfix = 0;

    SIGBRD_GetHWVersion(&SIGBRD_HW_version);
    SIGBRD_GetSWVersion(&SIGBRD_SW_version_major, &SIGBRD_SW_version_minor, &SIGBRD_SW_version_bugfix);

    SHELL_Printf(s_shellHandle, "SIGBOARD HW: v%d\r\n", SIGBRD_HW_version);
    SHELL_Printf(s_shellHandle, "SIGBOARD SW: v%d.%d.%d\r\n", SIGBRD_SW_version_major,
                 SIGBRD_SW_version_minor,SIGBRD_SW_version_bugfix);
#else
    SHELL_Printf(s_shellHandle, "SIGBOARD HW: - \r\n");
    SHELL_Printf(s_shellHandle, "SIGBOARD SW: - \r\n");
#endif /* ENABLE_SIGBOARD */
}

static shell_status_t EV_version_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

