nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/EVSE_Shell.c
    xResult = xEventGroupSetBitsFromISR(s_shell_event, EV_SHELL_VERSION_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

#else
#if ENABLE_WIFI
static shell_status_t EVSE_wifi_cmd_do(void)
{
    if ((evse_argc == 1) || (evse_argc > 4))
    {
        return kStatus_SHELL_Error;
    }

    if (strcmp(evse_argv[1], "set") == 0)
    {
        evse_wifi_cred_t evse_wifi_credentials = {0};
        char *wifi_ssid                        = NULL;
        char *wifi_pass                        = NULL;
        uint32_t ssid_len                      = 0;
        uint32_t pass_len                      = 0;

        wifi_ssid = evse_argv[2];
        ssid_len  = strlen(wifi_ssid);
        if (ssid_len > sizeof(evse_wifi_credentials.ssid.name))
        {
            return kStatus_SHELL_Error;
        }
        memcpy(evse_wifi_credentials.ssid.name, wifi_ssid, ssid_len);
        evse_wifi_credentials.ssid.length = ssid_len;

        if (evse_argc == 4)
        {
            wifi_pass = evse_argv[3];
            pass_len  = strlen(wifi_pass);
            if (pass_len > sizeof(evse_wifi_credentials.pass.name))
            {
                return kStatus_SHELL_Error;
            }

            memcpy(evse_wifi_credentials.pass.name, wifi_pass, pass_len);
            evse_wifi_credentials.pass.length = pass_len;

            if (EVSE_Connectivity_Wifi_Credentials_Flash_Save(&evse_wifi_credentials) == FLASH_FS_OK)
            {
                SHELL_Printf(s_shellHandle, "Wifi credentials saved\r\n");
                NVIC_SystemReset();
            }
            else
            {
                return kStatus_SHELL_Error;
            }
        }
    }
    else if (strcmp(evse_argv[1], "erase") == 0)
    {
        if (EVSE_Connectivity_Wifi_Credentials_Flash_Erase() == FLASH_FS_OK)
        {
            SHELL_Printf(s_shellHandle, "Wifi credentials erased from flash\r\n");
        }
        else
        {
            return kStatus_SHELL_Error;
        }
    }
    else if (strcmp(evse_argv[1], "print") == 0)
    {
        evse_wifi_cred_t evse_wifi_credentials = {0};
        if (EVSE_Connectivity_Wifi_Credentials_Flash_Read(&evse_wifi_credentials) == FLASH_FS_OK)
        {
            SHELL_Printf(s_shellHandle, "ssid: %s\r\n", evse_wifi_credentials.ssid.name);
            SHELL_Printf(s_shellHandle, "password: %s\r\n", evse_wifi_credentials.pass.name);
        }
        else
        {
            return kStatus_SHELL_Error;
        }
    }
    else
    {
        SHELL_Printf(s_shellHandle, "\r\nIncorrect command parameter(s)\r\n");
        return kStatus_SHELL_Error;
    }

    return kStatus_SHELL_Success;
}

static shell_status_t EVSE_wifi_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    if (argc > EVSE_ARGC_MAX)
    {
        return kStatus_SHELL_Error;
    }

    evse_argc = argc;
    for (uint8_t i = 0; i < argc; i++)
    {
        strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
        evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EVSE_SHELL_WIFI_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}
#endif /* ENABLE_WIFI */

#if ENABLE_SE
static shell_status_t EVSE_se05x_cmd_do(void)
{
    if ((evse_argc == 1) || (evse_argc > 3))
    {
        return kStatus_SHELL_Error;
    }

    if (strcmp(evse_argv[1], "erase") == 0)
    {
        EVSE_SE050_Open_Session();
        if (strcmp(evse_argv[2], "ocppkey") == 0)
        {
#if ENABLE_OCPP
            if (EVSE_SE050_Delete_OCPPKey() == kStatus_OCPPKey_Success)
            {
                SHELL_Printf(s_shellHandle, "Successfully deleted the OCPP client key\r\n");
            }
            else
            {
                SHELL_Printf(s_shellHandle, "Delete failed. OCPP client key missing or unattainable.\r\n");
            }
#else
            SHELL_Printf(s_shellHandle, "OCPP not enabled. You can't access the OCPP client key.\r\n");
#endif /* ENABLE_OCPP */
        }
        else if (strcmp(evse_argv[2], "cpokey") == 0)
        {
#if ENABLE_ISO15118
            if (EVSE_SE050_Delete_CPOKey() == kStatus_CPOKey_Success)
            {
                SHELL_Printf(s_shellHandle, "Successfully deleted CPO key\r\n");
            }
            else
            {
                SHELL_Printf(s_shellHandle, "Delete failed. CPO key missing or unattainable.\r\n");
            }
#else
            SHELL_Printf(s_shellHandle, "ISO15118 not enabled. You can't access the CPO key.\r\n");
#endif /* ENABLE_ISO15118 */
        }
        else
        {
            SHELL_Printf(s_shellHandle, "\r\nIncorrect command parameter(s)\r\n");
            EVSE_SE050_Close_Session();
            return kStatus_SHELL_Error;
        }
        EVSE_SE050_Close_Session();
    }
    else
    {
        SHELL_Printf(s_shellHandle, "\r\nIncorrect command parameter(s)\r\n");
        return kStatus_SHELL_Error;
    }

    return kStatus_SHELL_Success;
}

static shell_status_t EVSE_se05x_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    if (argc > EVSE_ARGC_MAX)
    {
        return kStatus_SHELL_Error;
    }

    evse_argc = argc;
    for (uint8_t i = 0; i < argc; i++)
    {
        strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
        evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EVSE_SHELL_SE05X_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }

    return kStatus_SHELL_Success;
}

#endif /* ENABLE_SE */

#if ENABLE_CHARGING_PROTOCOL

