nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/EVSE_Shell.c
void EVSE_Shell_SetCLIAuth(bool CLI_auth)
{
    s_authorizedFromCLI = CLI_auth;
}

bool EVSE_Shell_AllowAuth(bool *auth_result)
{
    if(auth_result == NULL)
    {
        return true;
    }

    *auth_result = false;

    /* Authorize charging if the user has no card to whitelist or shell is used */
    if(s_authorizedFromCLI)
    {
        *auth_result = true;
        return true;
    }

    return true;
}

static shell_status_t EVSE_auth_cmd_do(void)
{
    if ((evse_argc == 1) || (evse_argc > 2))
    {
        return kStatus_SHELL_Error;
    }

    if (strcmp(evse_argv[1], "true") == 0)
    {
        EVSE_Shell_SetCLIAuth(true);
        EVSE_ChargingProtocol_SetNFCAuthentication(AUTH_CARD_UID, sizeof(AUTH_CARD_UID));
        SHELL_Printf(s_shellHandle, "Set authenticated from cli\r\n");
    }
    else
    {
        return kStatus_SHELL_Error;
    }

    return kStatus_SHELL_Success;
}
#endif /* ENABLE_CHARGING_PROTOCOL */

#if ENABLE_ISO15118
static shell_status_t EVSE_payment_cmd_do(void)
{
    if (evse_argc != 2)
    {
        return kStatus_SHELL_Error;
    }

    if (strcmp(evse_argv[1], "eim") == 0)
    {
        EVSE_ChargingProtocol_SetPaymentMethod(VehicleAuth_EIM);
    }
    else if (strcmp(evse_argv[1], "pnc") == 0)
    {
        EVSE_ChargingProtocol_SetPaymentMethod(VehicleAuth_PnC);
    }
    else
    {
        return kStatus_SHELL_Error;
    }

    SHELL_Printf(s_shellHandle, "Set payment method %s\r\n", evse_argv[1]);

    return kStatus_SHELL_Success;
}

static shell_status_t EVSE_payment_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    evse_argc = argc;
    for (uint8_t i = 0; i < argc; i++)
    {
        strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
        evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EVSE_SHELL_PAYMENT_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static shell_status_t EVSE_auth_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    evse_argc = argc;
    for (uint8_t i = 0; i < argc; i++)
    {
        strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
        evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EVSE_SHELL_AUTH_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}
#endif /* ENABLE_ISO15118 */

static void EVSE_version_cmd_do(void)
{
    SHELL_Printf(s_shellHandle, "EVSE SW: v%d.%d.%d\r\n", FIRMWARE_VERSION_MAJOR, FIRMWARE_VERSION_MINOR,
                 FIRMWARE_VERSION_HOTFIX);

#if ENABLE_SIGBOARD
    const evse_data_t *evse_data = EVSE_Meter_GetEVSEData();
    SHELL_Printf(s_shellHandle, "SIGBOARD HW: v%d\r\n", evse_data->SIGBRD_HW_version);
    SHELL_Printf(s_shellHandle, "SIGBOARD SW: v%d.%d.%d\r\n", evse_data->SIGBRD_SW_version_major,
                 evse_data->SIGBRD_SW_version_minor, evse_data->SIGBRD_SW_version_bugfix);
#else
    SHELL_Printf(s_shellHandle, "SIGBOARD HW: - \r\n");
    SHELL_Printf(s_shellHandle, "SIGBOARD SW: - \r\n");
#endif /* ENABLE_SIGBOARD */
}

static shell_status_t EVSE_version_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EVSE_SHELL_VERSION_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static void EVSE_ocpp_info_cmd_do(void)
{
#if ENABLE_OCPP
	 SHELL_Printf(s_shellHandle, "Ocpp server URL: %s\r\n",EVSE_OCPP_SERVER_URL);
	 SHELL_Printf(s_shellHandle, "Ocpp server timeout: %d seconds\r\n",EVSE_OCPP_TIMEOUT_S);
	 SHELL_Printf(s_shellHandle, "Security Profile: %d\r\n", EVSE_OCPP_SECURITY_LEVEL);
	 SHELL_Printf(s_shellHandle, "Charge point ID: %s\r\n", CHARGE_POINT_ID);
#else
	 SHELL_Printf(s_shellHandle, "Ocpp not enabled ");
#endif
}

static shell_status_t EVSE_ocpp_info_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EVSE_SHELL_OCPP_INFO_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static void EVSE_charging_cmd_do(void)
{
#if ENABLE_ISO15118
    if (strcmp(evse_argv[1], "stop") == 0)
    {
        /* Do stop charging */
        EVSE_ChargingProtocol_StopCharging();
    }
    else if (strcmp(evse_argv[1], "start") == 0)
    {
        /* Do start charging */
        EVSE_ChargingProtocol_StartCharging();
    }
#endif /* ENABLE_ISO15118 */
}

static shell_status_t EVSE_charging_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    shell_status_t status = kStatus_SHELL_Success;

    if (argc != 2)
    {
        status = kStatus_SHELL_Error;
    }

    if (status == kStatus_SHELL_Success)
    {
        if ((strcmp(argv[1], "stop") != 0) && (strcmp(argv[1], "start") != 0))
        {
            return kStatus_SHELL_Error;
        }

        evse_argc = argc;
        for (uint8_t i = 0; i < argc; i++)
        {
            strncpy(evse_argv[i], argv[i], EVSE_ARGV_STR_MAX);
            evse_argv[i][EVSE_ARGV_STR_MAX - 1] = '\0';
        }
    }

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EVSE_SHELL_CHARGING_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}

static void EVSE_meter_info_cmd_do(void)
{
#if ENABLE_SIGBOARD
    uint32_t sw_version_major, sw_version_minor, sw_version_hotfix, hw_version;
    SIGBRD_GetSWVersion(&sw_version_major, &sw_version_minor, &sw_version_hotfix);
    configPRINTF(("shell SW value: \n\r"));
    SIGBRD_GetHWVersion(&hw_version);
    configPRINTF(("shell hW value: \n\r"));
    SHELL_Printf(s_shellHandle, "EMETER SW version: %d.%d.%d, HW version: %d\n\r", sw_version_major, sw_version_minor, sw_version_hotfix, hw_version);

    uint16_t pwm_ms = 0xFFFF;
    SIGBRD_GetPWMDutyInMilli(&pwm_ms);
    configPRINTF(("shell PWM value: %d\n\r", pwm_ms));
    SHELL_Printf(s_shellHandle, "PWM [ms]: %d\n\r", pwm_ms);

    uint16_t pp_state, cp_state, gfci_state;
    SIGBRD_GetPPState(&pp_state);
    configPRINTF(("shell PP state: %d\n\r", pp_state));
    SHELL_Printf(s_shellHandle, "PP state: %d\n\r", pp_state);

    SIGBRD_GetCPState(&cp_state);
    configPRINTF(("shell CP state: %d\n\r", cp_state));
    SHELL_Printf(s_shellHandle, "CP state: %d\n\r", cp_state);

