nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/EVSE_Shell.c
    SIGBRD_GetGFCIState(&gfci_state);
    SHELL_Printf(s_shellHandle, "GFCI state: %d\n\r", gfci_state);

    uint32_t adcVal = 0xFFFFFFFF;
    SIGBRD_GetADCVal(&adcVal);
    configPRINTF(("shell ADC value: %d\n\r", adcVal));
    SHELL_Printf(s_shellHandle, "ADC value: %d\n\r", adcVal);


    meter_data_t meter_data;
    SIGBRD_GetMetrologyAll(&meter_data);
    SHELL_Printf(s_shellHandle, "Current [A]: Ph1: %.2f, Ph2: %.2f, Ph3: %.2f\n\r", meter_data.currentPh1, meter_data.currentPh2, meter_data.currentPh3);
    SHELL_Printf(s_shellHandle, "Voltage [V]: Ph1: %.2f, Ph2: %.2f, Ph3: %.2f\n\r", meter_data.voltagePh1, meter_data.voltagePh2, meter_data.voltagePh3);
    SHELL_Printf(s_shellHandle, "Active power [W]: Ph1: %.2f, Ph2: %.2f, Ph3: %.2f\n\r", meter_data.PPh1, meter_data.PPh2, meter_data.PPh3);
    SHELL_Printf(s_shellHandle, "Reactive power [VAR]: Ph1: %.2f, Ph2: %.2f, Ph3: %.2f\n\r", meter_data.QPh1, meter_data.QPh2, meter_data.QPh3);
    SHELL_Printf(s_shellHandle, "Apparent power [VA]: Ph1: %.2f, Ph2: %.2f, Ph3: %.2f\n\r", meter_data.SPh1, meter_data.SPh2, meter_data.SPh3);

    uint8_t relay_state;
    SIGBRD_GetRelayState(&relay_state);
    SHELL_Printf(s_shellHandle, "Relay state: %d\n\r", relay_state);
#else
    SHELL_Printf(s_shellHandle, "Sigbrd not enabled\n\r");
#endif /* ENABLE_SIGBOARD */
}

static shell_status_t EVSE_meter_info_handler(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFAIL;

    xResult = xEventGroupSetBitsFromISR(s_shell_event, EVSE_SHELL_METER_INFO_EVENT, &xHigherPriorityTaskWoken);
    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    return kStatus_SHELL_Success;
}
#endif /* EASYEVSE_EV == 1 */

void EVSE_Shell_Task(void *arg)
{
    EventBits_t shellBits = 0U;

    configPRINTF(("EVSE shell ready to receive commands"));

    SHELL_Printf(s_shellHandle, "Welcome to EasyEVSE! \r\n");
    SHELL_Printf(s_shellHandle, SHELL_PROMPT);

    while (1)
    {
        shellBits = xEventGroupWaitBits(s_shell_event,         /* The event group being tested. */
                                        EVSE_SHELL_ALL_EVENTS, /* The bits within the event group to wait for. */
                                        pdTRUE, pdFALSE,       /* Don't wait for all bits, either bit will do. */
                                        portMAX_DELAY);        /* Wait until event */

#if (EASYEVSE_EV == 1)
        if (shellBits & (EV_SHELL_VERSION_EVENT))
        {
            EV_version_cmd_do();
        }

        if (shellBits & (EV_SHELL_CONNECT_DISCONNECT_CP_EVENT))
        {
            EV_cp_cmd_do();
        }

        if (shellBits & (EV_SHELL_START_STOP_CHARGING_EVENT))
        {
            EV_charge_cmd_do();
        }

        if (shellBits & (EV_SHELL_CHANGE_PROTOCOL_EVENT))
        {
            EV_protocol_cmd_do();
        }

        if (shellBits & (EV_SHELL_RESET_BATTERY_LEVEL_EVENT))
        {
            EV_battery_cmd_do();
        }

#if ENABLE_ISO15118
        if (shellBits & (EV_SHELL_CHANGE_AUTH_METHOD_EVENT))
        {
           EV_auth_cmd_do();
        }

        if (shellBits & (EV_SHELL_CHANGE_CHARGING_DIRECTION_EVENT))
        {
           EV_direction_cmd_do();
        }

        if (shellBits & (EV_SHELL_DATETIME_EVENT))
        {
           EV_datetime_cmd_do();
        }
#endif /* ENABLE_ISO15118 */

#else
        if ((shellBits & EVSE_SHELL_VERSION_EVENT) == EVSE_SHELL_VERSION_EVENT)
        {
            EVSE_version_cmd_do();
        }

#if ENABLE_WIFI
        if ((shellBits & EVSE_SHELL_WIFI_EVENT) == EVSE_SHELL_WIFI_EVENT)
        {
            EVSE_wifi_cmd_do();
        }
#endif /* ENABLE_WIFI */

#if ENABLE_SE
        if ((shellBits & EVSE_SHELL_SE05X_EVENT) == EVSE_SHELL_SE05X_EVENT)
        {
            EVSE_se05x_cmd_do();
        }
#endif /* ENABLE_SE */

#if ENABLE_CHARGING_PROTOCOL
        if ((shellBits & EVSE_SHELL_AUTH_EVENT) == EVSE_SHELL_AUTH_EVENT)
        {
            EVSE_auth_cmd_do();
        }
#endif /* ENABLE_CHARGING_PROTOCOL */
#if ENABLE_ISO15118
        else if ((shellBits & EVSE_SHELL_PAYMENT_EVENT) == EVSE_SHELL_PAYMENT_EVENT)
        {
            EVSE_payment_cmd_do();
        }
#endif /* ENABLE_ISO15118 */
        if ((shellBits & EVSE_SHELL_OCPP_INFO_EVENT) == EVSE_SHELL_OCPP_INFO_EVENT)
        {
            EVSE_ocpp_info_cmd_do();
        }

        if ((shellBits & EVSE_SHELL_CHARGING_EVENT) == EVSE_SHELL_CHARGING_EVENT)
        {
            EVSE_charging_cmd_do();
        }

        if ((shellBits & EVSE_SHELL_METER_INFO_EVENT) == EVSE_SHELL_METER_INFO_EVENT)
        {
            EVSE_meter_info_cmd_do();
        }
#endif
    }

    /* Shouldn't reach here, but to be sure */
    vTaskDelete(NULL);
}

void EVSE_Shell_Init(void)
{
    /* Init Serial Manager */
    serial_manager_config_t serialConfig;

    serial_port_usb_cdc_config_t usbCdcConfig = {
        .controllerIndex = (serial_port_usb_cdc_controller_index_t)CONTROLLER_ID,
    };

    USB_DeviceClockInit();

    serialConfig.type       = kSerialPort_UsbCdc;
    serialConfig.portConfig = &usbCdcConfig;
    serialConfig.blockType  = kSerialManager_Blocking;
#if (defined(SERIAL_MANAGER_NON_BLOCKING_MODE) && (SERIAL_MANAGER_NON_BLOCKING_MODE > 0U))
    serialConfig.ringBuffer     = &s_readRingBuffer[0];
    serialConfig.ringBufferSize = EVSE_SERIAL_MANAGER_RECEIVE_BUFFER_LEN;
    serialConfig.blockType      = kSerialManager_NonBlocking;
#endif
    if (SerialManager_Init(s_serialHandle, &serialConfig) != kStatus_SerialManager_Success)
    {
        configPRINTF((error(" %s Failed to init serial manager "), __FUNCTION__));
        while (1)
            ;
    }

    /* Init EVSE Shell */
    s_shellHandle = &s_shellHandleBuffer[0];

    SHELL_Init(s_shellHandle, s_serialHandle, SHELL_PROMPT);

    for (uint8_t i = 0; i < (sizeof(shell_commands_list) / sizeof(shell_commands_list[0])); i++)
    {
        SHELL_RegisterCommand(s_shellHandle, shell_commands_list[i]);
    }

    s_shell_event = xEventGroupCreate();
    if (s_shell_event == NULL)
    {
        configPRINTF((error(" %s Failed to create event group "), __FUNCTION__));
        while (1)
            ;
    }

    if (xTaskCreate(EVSE_Shell_Task, "Shell Task", APP_SHELL_STACK_SIZE, NULL, APP_SHELL_PRIORITY, NULL) != pdPASS)
    {
        configPRINTF((error(" %s Failed to create task "), __FUNCTION__));
        while (1)
            ;
    }
}

#endif /* ENABLE_SHELL */
